#### Terraform Validation & Plan Results
* Terraform Version 📎`1.9.8`
* Working Directory 📂`./code/infra`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mdata.local_file.file_user_prompt: Reading...[0m[0m
[0m[1mdata.local_file.file_system_prompt: Reading...[0m[0m
[0m[1mdata.local_file.file_system_prompt: Read complete after 0s [id=5f25a8d2f2d140f83e5a49e409291f0588e57794][0m
[0m[1mdata.local_file.file_user_prompt: Read complete after 0s [id=7f99964f8545486a2732b0fe4270b31047da70bc][0m
[0m[1mdata.azurerm_log_analytics_workspace.log_analytics_workspace: Reading...[0m[0m
[0m[1mdata.azurerm_log_analytics_workspace.log_analytics_workspace: Read complete after 0s [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001][0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.azure_ai_speech.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mmodule.azure_open_ai.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mmodule.storage_account.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.azure_ai_generic.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mazurerm_resource_group.resource_group: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg][0m
[0m[1mmodule.azure_ai_speech.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.azure_ai_generic.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.storage_account.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.azure_open_ai.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.key_vault.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.key_vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mdata.azurerm_route_table.route_table: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/routeTables/ptt-dev-default-rt001][0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/networkSecurityGroups/ptt-dev-default-nsg001][0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001][0m
[0m[1mazapi_resource.subnet_function: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/WebAppSubnet][0m
[0m[1mmodule.application_insights.azurerm_application_insights.application_insights: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Insights/components/vdnlytcs-dev-appi001][0m
[0m[1mmodule.app_service_plan.azurerm_service_plan.service_plan: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Web/serverFarms/vdnlytcs-dev-asp001][0m
[0m[1mmodule.azure_open_ai.azurerm_cognitive_account.cognitive_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aoai001][0m
[0m[1mmodule.user_assigned_identity.azurerm_user_assigned_identity.user_assigned_identity: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/vdnlytcs-dev-uai001][0m
[0m[1mmodule.storage_account.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001][0m
[0m[1mmodule.key_vault.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.KeyVault/vaults/vdnlytcs-dev-kv001][0m
[0m[1mmodule.app_service_plan.azurerm_monitor_diagnostic_setting.diagnostic_setting_service_plan["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Web/serverFarms/vdnlytcs-dev-asp001|applicationLogs-0][0m
[0m[1mazurerm_role_assignment.uai_roleassignment_open_ai_contributor: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aoai001/providers/Microsoft.Authorization/roleAssignments/f92b632c-9832-1ba7-04ed-3af12e549069][0m
[0m[1mmodule.azure_open_ai.azapi_update_resource.cognitive_account_bypass_azureservices[0]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aoai001][0m
[0m[1mmodule.azure_open_ai.azurerm_monitor_diagnostic_setting.diagnostic_setting_cognitive_account["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aoai001|applicationLogs-0][0m
[0m[1mazurerm_cognitive_deployment.cognitive_deployment_gpt_4o: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aoai001/deployments/gpt-4o][0m
[0m[1mmodule.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Reading...[0m[0m
[0m[1mmodule.key_vault.azurerm_role_assignment.current_roleassignment_key_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.KeyVault/vaults/vdnlytcs-dev-kv001/providers/Microsoft.Authorization/roleAssignments/2d174ca4-87c0-e240-1145-1c080a74b463][0m
[0m[1mazurerm_role_assignment.uai_roleassignment_key_vault_secrets_officer: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.KeyVault/vaults/vdnlytcs-dev-kv001/providers/Microsoft.Authorization/roleAssignments/bffb2783-9a9f-7567-0c91-15044a442bc8][0m
[0m[1mazapi_resource.subnet_private_endpoints: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/PrivateEndpointSubnet][0m
[0m[1mmodule.azure_open_ai.azurerm_private_endpoint.private_endpoint_cognitive_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Network/privateEndpoints/vdnlytcs-dev-aoai001-account-pe][0m
[0m[1mmodule.key_vault.azurerm_private_endpoint.private_endpoint_cognitive_account_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Network/privateEndpoints/vdnlytcs-dev-kv001-vault-pe][0m
[0m[1mmodule.application_insights.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Reading...[0m[0m
[0m[1mmodule.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.KeyVault/vaults/vdnlytcs-dev-kv001][0m
[0m[1mmodule.key_vault.azurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.KeyVault/vaults/vdnlytcs-dev-kv001|applicationLogs-0][0m
[0m[1mmodule.application_insights.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Insights/components/vdnlytcs-dev-appi001][0m
[0m[1mmodule.application_insights.azurerm_monitor_diagnostic_setting.diagnostic_setting_application_insights["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Insights/components/vdnlytcs-dev-appi001|applicationLogs-0][0m
[0m[1mmodule.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["file"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Network/privateEndpoints/vdnlytcsdevstg001-file-pe][0m
[0m[1mmodule.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["queue"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Network/privateEndpoints/vdnlytcsdevstg001-queue-pe][0m
[0m[1mmodule.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["blob"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Network/privateEndpoints/vdnlytcsdevstg001-blob-pe][0m
[0m[1mmodule.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["table"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Network/privateEndpoints/vdnlytcsdevstg001-table-pe][0m
[0m[1mazurerm_role_assignment.uai_roleassignment_storage_queue_data_contributor: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001/providers/Microsoft.Authorization/roleAssignments/6da2505d-321f-c471-d062-6851ee2daf6a][0m
[0m[1mazurerm_role_assignment.uai_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001/providers/Microsoft.Authorization/roleAssignments/0b76d042-6567-a535-63a9-fe36d0281a51][0m
[0m[1mmodule.storage_account.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001/providers/Microsoft.Authorization/roleAssignments/2e2aca89-6272-bb0a-8268-ce7e206af733][0m
[0m[1mmodule.storage_account.azurerm_monitor_diagnostic_setting.diagnostic_setting_storage_account["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001|applicationLogs-0][0m
[0m[1mmodule.azure_ai_generic.azurerm_cognitive_account.cognitive_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aig001][0m
[0m[1mmodule.azure_ai_speech.azurerm_cognitive_account.cognitive_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-ais001][0m
[0m[1mmodule.key_vault.time_sleep.sleep_connectivity: Refreshing state... [id=2024-10-28T08:09:37Z][0m
[0m[1mmodule.azure_open_ai.time_sleep.sleep_connectivity: Refreshing state... [id=2024-10-28T08:10:24Z][0m
[0m[1mmodule.storage_account.time_sleep.sleep_connectivity: Refreshing state... [id=2024-10-28T08:10:41Z][0m
[0m[1mmodule.storage_account.azurerm_storage_container.storage_container["internal-analysis-video"]: Refreshing state... [id=https://vdnlytcsdevstg001.blob.core.windows.net/internal-analysis-video][0m
[0m[1mmodule.storage_account.azurerm_storage_container.storage_container["internal-videos"]: Refreshing state... [id=https://vdnlytcsdevstg001.blob.core.windows.net/internal-videos][0m
[0m[1mmodule.storage_account.azurerm_storage_container.storage_container["results-newsvideos"]: Refreshing state... [id=https://vdnlytcsdevstg001.blob.core.windows.net/results-newsvideos][0m
[0m[1mmodule.storage_account.azurerm_storage_container.storage_container["upload-newsvideos"]: Refreshing state... [id=https://vdnlytcsdevstg001.blob.core.windows.net/upload-newsvideos][0m
[0m[1mmodule.storage_account.azurerm_storage_container.storage_container["internal-analysis-speech"]: Refreshing state... [id=https://vdnlytcsdevstg001.blob.core.windows.net/internal-analysis-speech][0m
[0m[1mazurerm_key_vault_secret.key_vault_secret_azure_ai_speech_cognitive_account_primary_access_key: Refreshing state... [id=https://vdnlytcs-dev-kv001.vault.azure.net/secrets/azure-ai-speech-primary-access-key/33c7d70bad3d41f9b350dd469f9573d1][0m
[0m[1mmodule.azure_ai_speech.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account: Reading...[0m[0m
[0m[1mmodule.azure_ai_speech.azapi_update_resource.cognitive_account_bypass_azureservices[0]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-ais001][0m
[0m[1mmodule.azure_ai_speech.azurerm_private_endpoint.private_endpoint_cognitive_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Network/privateEndpoints/vdnlytcs-dev-ais001-account-pe][0m
[0m[1mazurerm_role_assignment.ai_speech_roleassignment_storage_blob_data_reader: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001/blobServices/default/containers/internal-videos/providers/Microsoft.Authorization/roleAssignments/d763c3fd-8e43-67c8-c8a6-3d37ef5fc066][0m
[0m[1mazurerm_role_assignment.ai_speech_roleassignment_cognitive_services_openai_user: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aoai001/providers/Microsoft.Authorization/roleAssignments/66451548-d3e7-6fe8-2d0a-2e10fd898301][0m
[0m[1mazurerm_role_assignment.ai_speech_roleassignment_storage_blob_data_contributor: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001/blobServices/default/containers/internal-analysis-speech/providers/Microsoft.Authorization/roleAssignments/ce6155f5-1039-d3e4-d439-f9b5e55fac39][0m
[0m[1mmodule.azure_ai_speech.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-ais001][0m
[0m[1mmodule.azure_ai_generic.azurerm_private_endpoint.private_endpoint_cognitive_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Network/privateEndpoints/vdnlytcs-dev-aig001-account-pe][0m
[0m[1mmodule.azure_ai_generic.azapi_update_resource.cognitive_account_bypass_azureservices[0]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aig001][0m
[0m[1mmodule.azure_ai_speech.azurerm_monitor_diagnostic_setting.diagnostic_setting_cognitive_account["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-ais001|applicationLogs-0][0m
[0m[1mazurerm_role_assignment.uai_roleassignment_cognitive_services_user: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aig001/providers/Microsoft.Authorization/roleAssignments/ade6e0ca-916d-c19e-a708-ce8c5d351b99][0m
[0m[1mazurerm_role_assignment.cognitive_account_roleassignment_cognitive_services_openai_user: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aoai001/providers/Microsoft.Authorization/roleAssignments/b387adc6-654d-446b-2aa8-d76d886fc074][0m
[0m[1mazurerm_role_assignment.cognitive_account_roleassignment_storage_blob_data_reader: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001/blobServices/default/containers/internal-videos/providers/Microsoft.Authorization/roleAssignments/c6ee12c3-db28-ccbc-59c2-ed794e584acf][0m
[0m[1mazurerm_role_assignment.cognitive_account_roleassignment_storage_blob_data_contributor: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001/blobServices/default/containers/internal-analysis-video/providers/Microsoft.Authorization/roleAssignments/ed26faf8-bf37-412f-cf32-37b03564f5f7][0m
[0m[1mmodule.azure_ai_generic.azurerm_monitor_diagnostic_setting.diagnostic_setting_cognitive_account["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aig001|applicationLogs-0][0m
[0m[1mazurerm_linux_function_app.linux_function_app: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Web/sites/vdnlytcs-dev-app001][0m
[0m[1mmodule.azure_ai_generic.time_sleep.sleep_connectivity: Refreshing state... [id=2024-10-28T08:10:49Z][0m
[0m[1mmodule.azure_ai_speech.time_sleep.sleep_connectivity: Refreshing state... [id=2024-10-28T08:10:48Z][0m
[0m[1mazurerm_role_assignment.function_roleassignment_storage_account_contributor: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001/providers/Microsoft.Authorization/roleAssignments/0d819dad-6386-ea44-cf57-36d1fa0ac06e][0m
[0m[1mazurerm_role_assignment.function_roleassignment_storage_queue_data_contributor: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001/providers/Microsoft.Authorization/roleAssignments/54f699c6-55cf-48ec-e44f-002f96fad548][0m
[0m[1mazurerm_role_assignment.function_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001/providers/Microsoft.Authorization/roleAssignments/3af7495f-5de6-4774-6275-be94efad4d90][0m
[0m[1mazurerm_private_endpoint.linux_function_app_private_endpoint: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Network/privateEndpoints/vdnlytcs-dev-app001-pe][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_linux_function_app: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Web/sites/vdnlytcs-dev-app001|logAnalytics][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [33m~[0m update in-place[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_linux_function_app[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_linux_function_app" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Web/sites/vdnlytcs-dev-app001"
    }

[1m  # azurerm_linux_function_app.linux_function_app[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_linux_function_app" "linux_function_app" {
      [33m~[0m[0m app_settings                                   = {
          [33m~[0m[0m "SYSTEM_PROMPT"                                   = <<-EOT
                You are a world class assistant for identifying news sections. You will be provided with a transcript from a TV news show. Your task is to extract thematic news sections from the transcript that split the content into cohesive news topics. You must define a title and tags for each news section based on the content of each section and translate them into the language of the transcript.
                Solve this step by step:
                1. Process the provided transcript to understand the overall context.
                2. Split the provided news content into news sections. The content of each section must cover a common topic or headline. Follow the grounding rules for new sections mentioned below. Assign an ID to every news section.
                3. Extract the first sentence and last sentence of each section in the transcript. Define the first sentence as start and the last sentence as end. Follow the gounding rules for start and end mentioned below.
                4. Generate a title for each news section. Translate the title into the language of the transcript.
                5. Add a single category to each section that matches the content. Use a value from the following list: politics, sports, economy, environment, international, technology, health, meteorology, national, culture, justice, events.
                6. Add tags to each section. English samples for tags are: sports, weather, international news, national news, politics, crime, technology, celebrity, other. Add matching samples to the sections and generate up to 5 additional tags based on the content of each section. Translate the tags into the original language of the transcript.
                7. Generate a score between 0 and 10 for each section. The score indicates how good the defined tags match the content of the section. 0 indicates that the tags don't match the content, and 10 means that the tags are a perfect match.
                8. Provide a valid JSON response that uses the response schema mentioned below.
                ---
                Grounding rules for news sections:
                - The first sentence of the transcript must be part of the first news section. The last sentence of the transcript must be part of the last news section.
                - Each news section must start and end with a full sentence and must consist of 2 or more sentences. It is ok if some news sections consist of 20 or more sentences and other sections only consist of 2 or more sentences.
                - Each sentence of the transcript must be part of exactly one news section. No sentence can be part of multiple news sections.
                - If you are unsure about the assignment of one sentence, then assign it to the previous section.
                - The last sentence of one news section must by followed by the first sentence of the next news section.
                - The news sections are not allowed to overlap and must be mutually exclusive. This means that between the first sentence and the last sentence of one news section, there can be no first sentence or last sentence of another news section in the transcript.
                - The transcript often start with an introduction. The introduction summarizes some news sections of the transcript which reappear later in the transcript. Identify the introduction and give it the title "News Show Summary". Add the following tags to this news section: intro, overview, news summary.
                - The transcript often contains a weather forecast section. Identify this news section and give it the title "Weather Forecast". Add the following tags to this news section: weather, weather forecast.
                ---
                Grounding rules for start and end:
                - The extracted first and last sentence must be an exact string representation of the sentences in the transcript.
                - Include the same punctuation as in the transcript.
                - Words must have the same form and must be in the exact same order as in the transcript.
                - If the first or the last sentence of a news section just consists of a single word, then include the first two or last two sentences and define them as start and end.
                ---
                Response schema:
                {format_instructions}
            EOT
          [33m~[0m[0m "USER_PROMPT"                                     = <<-EOT
                Transcript:
                {news_content}
                ---
                Language of the transcript:
                {language}
                ---
                Identify news sections for the provided transcript according to the instructions. The text is from the following tv show: {news_show_details}
            EOT
            [90m# (32 unchanged elements hidden)[0m[0m
        }
        id                                             = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Web/sites/vdnlytcs-dev-app001"
        name                                           = "vdnlytcs-dev-app001"
      [33m~[0m[0m tags                                           = {
          [31m-[0m[0m "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=247286b8-1871-481e-bfa6-99e23e983fff;IngestionEndpoint=https://northeurope-2.in.applicationinsights.azure.com/;LiveEndpoint=https://northeurope.livediagnostics.monitor.azure.com/;ApplicationId=3324eaa8-f171-4754-b851-60ec0495de5d" [90m-> null[0m[0m
          [31m-[0m[0m "hidden-link: /app-insights-instrumentation-key" = "247286b8-1871-481e-bfa6-99e23e983fff" [90m-> null[0m[0m
          [31m-[0m[0m "hidden-link: /app-insights-resource-id"         = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/microsoft.insights/components/vdnlytcs-dev-appi001" [90m-> null[0m[0m
            "workload"                                       = "video-analytics"
        }
        [90m# (32 unchanged attributes hidden)[0m[0m

        [90m# (2 unchanged blocks hidden)[0m[0m
    }

[1m  # azurerm_monitor_diagnostic_setting.diagnostic_setting_linux_function_app[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_linux_function_app" {
        id                             = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Web/sites/vdnlytcs-dev-app001|logAnalytics"
        name                           = "logAnalytics"
        [90m# (5 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m enabled_log (known after apply)
      [31m-[0m[0m enabled_log {
          [31m-[0m[0m category_group = "allLogs" [90m-> null[0m[0m
            [90m# (1 unchanged attribute hidden)[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }
      [31m-[0m[0m enabled_log {
          [31m-[0m[0m category_group = "audit" [90m-> null[0m[0m
            [90m# (1 unchanged attribute hidden)[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }

      [33m~[0m[0m metric (known after apply)
      [31m-[0m[0m metric {
          [31m-[0m[0m category = "AllMetrics" [90m-> null[0m[0m
          [31m-[0m[0m enabled  = true [90m-> null[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }
    }

[1m  # module.app_service_plan.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_service_plan[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_service_plan" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Web/serverFarms/vdnlytcs-dev-asp001"
    }

[1m  # module.app_service_plan.azurerm_monitor_diagnostic_setting.diagnostic_setting_service_plan["0"][0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_service_plan" {
        id                             = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Web/serverFarms/vdnlytcs-dev-asp001|applicationLogs-0"
        name                           = "applicationLogs-0"
        [90m# (5 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m enabled_log (known after apply)

      [33m~[0m[0m metric (known after apply)
      [31m-[0m[0m metric {
          [31m-[0m[0m category = "AllMetrics" [90m-> null[0m[0m
          [31m-[0m[0m enabled  = true [90m-> null[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }
    }

[1m  # module.app_service_plan.azurerm_service_plan.service_plan[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_service_plan" "service_plan" {
        id                           = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Web/serverFarms/vdnlytcs-dev-asp001"
        name                         = "vdnlytcs-dev-asp001"
      [33m~[0m[0m sku_name                     = "EP2" [33m->[0m[0m "EP1"
        tags                         = {
            "workload" = "video-analytics"
        }
        [90m# (10 unchanged attributes hidden)[0m[0m
    }

[1m  # module.azure_ai_generic.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_cognitive_account" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aig001"
    }

[1m  # module.azure_ai_generic.azapi_update_resource.cognitive_account_bypass_azureservices[0][0m will be updated in-place
[0m  [33m~[0m[0m resource "azapi_update_resource" "cognitive_account_bypass_azureservices" {
      [33m~[0m[0m body                    = {
          [33m~[0m[0m properties = {
              [33m~[0m[0m networkAcls         = {
                  [33m~[0m[0m bypass              = [90mnull[0m[0m [33m->[0m[0m "AzureServices"
                  [33m~[0m[0m defaultAction       = "Allow" [33m->[0m[0m "Deny"
                    [90m# (2 unchanged attributes hidden)[0m[0m
                }
              [33m~[0m[0m publicNetworkAccess = "Enabled" [33m->[0m[0m "Disabled"
            }
        }
        id                      = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aig001"
        name                    = "vdnlytcs-dev-aig001"
      [33m~[0m[0m output                  = {} -> (known after apply)
        [90m# (7 unchanged attributes hidden)[0m[0m
    }

[1m  # module.azure_ai_generic.azurerm_cognitive_account.cognitive_account[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_cognitive_account" "cognitive_account" {
        id                                          = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aig001"
        name                                        = "vdnlytcs-dev-aig001"
      [33m~[0m[0m public_network_access_enabled               = true [33m->[0m[0m false
        tags                                        = {
            "workload" = "video-analytics"
        }
        [90m# (18 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m network_acls {
          [33m~[0m[0m default_action = "Allow" [33m->[0m[0m "Deny"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # module.azure_ai_generic.azurerm_monitor_diagnostic_setting.diagnostic_setting_cognitive_account["0"][0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_cognitive_account" {
        id                             = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aig001|applicationLogs-0"
        name                           = "applicationLogs-0"
        [90m# (5 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m enabled_log (known after apply)
      [31m-[0m[0m enabled_log {
          [31m-[0m[0m category_group = "Audit" [90m-> null[0m[0m
            [90m# (1 unchanged attribute hidden)[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }
      [31m-[0m[0m enabled_log {
          [31m-[0m[0m category_group = "allLogs" [90m-> null[0m[0m
            [90m# (1 unchanged attribute hidden)[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }

      [33m~[0m[0m metric (known after apply)
      [31m-[0m[0m metric {
          [31m-[0m[0m category = "AllMetrics" [90m-> null[0m[0m
          [31m-[0m[0m enabled  = true [90m-> null[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }
    }

[1m  # module.azure_ai_speech.azapi_update_resource.cognitive_account_bypass_azureservices[0][0m will be updated in-place
[0m  [33m~[0m[0m resource "azapi_update_resource" "cognitive_account_bypass_azureservices" {
      [33m~[0m[0m body                    = {
          [33m~[0m[0m properties = {
              [33m~[0m[0m networkAcls         = {
                  [33m~[0m[0m bypass              = [90mnull[0m[0m [33m->[0m[0m "AzureServices"
                    [90m# (3 unchanged attributes hidden)[0m[0m
                }
                [90m# (1 unchanged attribute hidden)[0m[0m
            }
        }
        id                      = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-ais001"
        name                    = "vdnlytcs-dev-ais001"
      [33m~[0m[0m output                  = {} -> (known after apply)
        [90m# (7 unchanged attributes hidden)[0m[0m
    }

[1m  # module.azure_open_ai.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_cognitive_account" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aoai001"
    }

[1m  # module.azure_open_ai.azapi_update_resource.cognitive_account_bypass_azureservices[0][0m will be updated in-place
[0m  [33m~[0m[0m resource "azapi_update_resource" "cognitive_account_bypass_azureservices" {
      [33m~[0m[0m body                    = {
          [33m~[0m[0m properties = {
              [33m~[0m[0m networkAcls         = {
                  [33m~[0m[0m bypass              = [90mnull[0m[0m [33m->[0m[0m "AzureServices"
                  [33m~[0m[0m defaultAction       = "Allow" [33m->[0m[0m "Deny"
                    [90m# (2 unchanged attributes hidden)[0m[0m
                }
              [33m~[0m[0m publicNetworkAccess = "Enabled" [33m->[0m[0m "Disabled"
            }
        }
        id                      = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aoai001"
        name                    = "vdnlytcs-dev-aoai001"
      [33m~[0m[0m output                  = {} -> (known after apply)
        [90m# (7 unchanged attributes hidden)[0m[0m
    }

[1m  # module.azure_open_ai.azurerm_cognitive_account.cognitive_account[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_cognitive_account" "cognitive_account" {
        id                                          = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aoai001"
        name                                        = "vdnlytcs-dev-aoai001"
      [33m~[0m[0m public_network_access_enabled               = true [33m->[0m[0m false
        tags                                        = {
            "workload" = "video-analytics"
        }
        [90m# (18 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m network_acls {
          [33m~[0m[0m default_action = "Allow" [33m->[0m[0m "Deny"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # module.azure_open_ai.azurerm_monitor_diagnostic_setting.diagnostic_setting_cognitive_account["0"][0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_cognitive_account" {
        id                             = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aoai001|applicationLogs-0"
        name                           = "applicationLogs-0"
        [90m# (5 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m enabled_log (known after apply)
      [31m-[0m[0m enabled_log {
          [31m-[0m[0m category_group = "Audit" [90m-> null[0m[0m
            [90m# (1 unchanged attribute hidden)[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }
      [31m-[0m[0m enabled_log {
          [31m-[0m[0m category_group = "allLogs" [90m-> null[0m[0m
            [90m# (1 unchanged attribute hidden)[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }

      [33m~[0m[0m metric (known after apply)
      [31m-[0m[0m metric {
          [31m-[0m[0m category = "AllMetrics" [90m-> null[0m[0m
          [31m-[0m[0m enabled  = true [90m-> null[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }
    }

[1m  # module.storage_account.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_storage_account" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001"
    }

[1m  # module.storage_account.azurerm_monitor_diagnostic_setting.diagnostic_setting_storage_account["0"][0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_storage_account" {
        id                             = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001|applicationLogs-0"
        name                           = "applicationLogs-0"
        [90m# (5 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m enabled_log (known after apply)

      [33m~[0m[0m metric (known after apply)
      [31m-[0m[0m metric {
          [31m-[0m[0m category = "Capacity" [90m-> null[0m[0m
          [31m-[0m[0m enabled  = true [90m-> null[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }
      [31m-[0m[0m metric {
          [31m-[0m[0m category = "Transaction" [90m-> null[0m[0m
          [31m-[0m[0m enabled  = true [90m-> null[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }
    }

[1m  # module.storage_account.azurerm_storage_account.storage_account[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001"
        name                               = "vdnlytcsdevstg001"
        tags                               = {
            "workload" = "video-analytics"
        }
        [90m# (96 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m network_rules {
          [33m~[0m[0m bypass                     = [
              [31m-[0m[0m "AzureServices",
              [32m+[0m[0m "None",
            ]
          [33m~[0m[0m default_action             = "Allow" [33m->[0m[0m "Deny"
            [90m# (2 unchanged attributes hidden)[0m[0m

          [33m~[0m[0m private_link_access {
              [33m~[0m[0m endpoint_resource_id = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/*/providers/Microsoft.CognitiveServices/accounts/*" [33m->[0m[0m "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/providers/Microsoft.Security/datascanners/storageDataScanner"
                [90m# (1 unchanged attribute hidden)[0m[0m
            }
          [33m~[0m[0m private_link_access {
              [33m~[0m[0m endpoint_resource_id = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/providers/Microsoft.Security/datascanners/storageDataScanner" [33m->[0m[0m "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/*/providers/Microsoft.CognitiveServices/accounts/*"
                [90m# (1 unchanged attribute hidden)[0m[0m
            }
        }

        [90m# (5 unchanged blocks hidden)[0m[0m
    }

[1mPlan:[0m 0 to add, 13 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>